-- made by { @Mouamle }
do
ws = {}
rs = {}

-- some examples of how to use this :3
ws[1] = "هلاو" 
rs[1] = "هلاوووات حياتي ❤️🙈"

ws[2] = "هلو" -- msg
rs[2] = "هلاوات 🙈❤️" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "بخير بوجودك قَـلبِـ❤️ـي 🙈" -- reply

ws[4] = "ابراهيم" -- msg 
rs[4] = "😍فديتك بعد جبدي ونور عيوني🤗" -- reply

ws[5] = "شونك"
rs[5] = "الحمدلله وانته"

ws[6] = "شلونك"
rs[6] = "الحمدلله وانته"

ws[7] = "ليث"
rs[7] = "😍فديتك بعد جبدي ونور عيوني🤗"

ws[8] = "غدير"
rs[8] = "☺️يّمّهّ يّمّهّ هّاّيّ اّلّصّاّكّهّ🤗 لّحّدّ يّزّحّفّلّهّاّ هّاّيّ مّاّلّتّيّ 👍️"

ws[9] = "ديفل"
rs[9] = "❣حْبِيْبِيْ ۄعَيْۄنّيْ  دِيْفْلَ ❣"

ws[10] = "مرتضى"
rs[10] = "😍شّبّيّ اّلّصّاّكّ😚 لّحّدّ يّكّلّمّةّ هّذاّ مّاّلّتّيّ ✋"

ws[11] = "علوش"
rs[11] = "❣عَلَۄشٌتْيْ يْآ بِعَدِ رَۄحْيْ❣"

ws[12] = "مريم"
rs[12] = "😍تتحدث عن الجمال😍 انت لا تتقرب تتكهرب😂"

ws[13] = "نور"
rs[13] = "🙈هِّيِّهِّ مِّنِّ آسَّمِّهِّآ 🙈مِّبٍّيِّنِّهِّ مِّآ حَّآجِّةٍّ نِّﮝلِّلِّﮝمِّ مِّنِّوٍّرِةٍّ☺️"

ws[14] = "محمد"
rs[14] = "😚فٍّدٍّيِّتٍّهِّ حَّمِّآدٍّهِّ حَّبٍّيِّبٍّيِّ 😚هِّذآ آلِّمِّطِّوٍّرِ مِّآلِّتٍّيِّ آلِّثٍّآنِّيِّ❣ رِئيِّسَّ عَّصِّآبٍّةٍّ مِّنِّطِّقٍّنِّةٍّ طِّوٍّلِّهِّ 182 😱آطِّوٍّلِّ مِّنِّ حَّرِبٍّ آيِّرِآنِّ 😂شِّآيِّلِّ سَّجِّيِّنِّهِّ دٍّيِّرِوٍّ بٍّآلِّﮝمِّ🗡"

ws[15] = "فاطمه"
rs[15] = "🤗فٍّآطِّمِّةٍّ يِّآ جِّﮝلِّيِّتٍّهِّ🤗 حَّآمِِّّضِّ حَّلِّوٍّ بٍّآﮝيِّتٍّهِّ🙈"

ws[16] = "لصمتي حكايه"
rs[16] = "✋اٍّنِّتُّ تُّتُّحّْدٌّثّْ عَّنِّ اٍّلَّمُّوّهّْبّْةْ✋🤗 وّاٍّلَّجٍّمُّاٍّلَّ وّاٍّلَّلَّيٌّاٍّقِّهّْ وّاٍّلَّرًّشّْاٍّقِّهّْ🤗 وّاٍّلَّشّْعَّرًّ وّاٍّلَّرًّكّْصُّ لَّلَّصُّبّْحّْ😂"

ws[17] = "زينب"
rs[17] = "😅زنوبة أم كفشة 😅"

ws[18] = "اسامه"
rs[18] = "ضلـ😍ـعُ ألمطُـ❣ـورْ مالتي فديته 🙊🌺" 

ws[19] = "اكتبلي قصيده"
rs[19] = "عشت ذات مره وسط قطيع خرفا يسير تائها تملؤه الاوهان 🙁ينام كل ليلة عطشان جوعان رغم أن أرضه خضراء كالبستان ولكننا قطيع خرفان ! لنا راع همه بيع ألصوف والألبان يتركنا جوعى يملؤنا ألحرمان يوما قرر ألخرفان🐏 أستبدال ألراعي فلان براع رحيم يملؤهم حنان غير أنهم خرفان فأنتخبو بالأغلبيه فلان"

ws[20] = "ياسر"
rs[20] = "😂أوّيّلّيّ عّلّيّكّ يّاّسّرّ شّكّدّ أكّرّهّكّ مّنّ وّرّهّ يّاّسّرّ اّلّقّحّطّاّنّيّ✋"

ws[21] = "رياض"
rs[21] = "🙈مَبَيَنَ مَنَ أسَمَكَ 🙈رَيَاََضَيَ 🏋🏻وًّرَشَيَقَ وًّعَظَلَاَتَ 🏋🏻اَلَلَهَ وًّكَيَلَكَمَ عَطَلَاَتَ 24 سَاَعَةٍ😂"

ws[22] = "اكتبلي حكمه"
rs[22] = "لا يستطيع أحد ركوب ظهرك ألا أذا أنحنيت😊🌺"

ws[23] = "سجاد"
rs[23] = "😏كافي ليمون نريد ركي😋"

ws[24] = "بعد وحده"
rs[24] = "أعبد حجراً لو شئت لكن لا ترميني بهْ 😑🚶🏻"

ws[25] = "هاي"
rs[25] = "هايات 🙈🍷"

ws[26] = "مريم"
rs[26] = "😍تْتْحْدْثْ عْنْ آلْجْمْآلْ😍 آنْتْ لْآ تْتْقْرْبْ تْتْڪْﮬ̲̣̐رْبْ😂"

ws[27] = "البوت واكف"
rs[27] = "لتجذب 😒"

ws[28] = "اسد"
rs[28] = "🙈عيون أسد فديتك بعد روحي أمرني خادمك☺️"

ws[29] = "كلاش اوف كلانس"
rs[29] = "تلعبهه ؟ شكد لفلك ؟"

ws[30] = "اتفل"
rs[30] = "💦خخخخخخخ تف💦 "

ws[31] = "عندك بعد"
rs[31] = "أنجب كافي أني بوت مو فيلسوف 😑👊🏻"

ws[32] = "والله"
rs[32] = "شَكو واحدْ يحلف كذاب 🙁🌺"

ws[33] = "شنو رايك بشباب الكروب"
rs[33] = "بكروبنه ألشبانْ كلهم مواقف 😌💪🏻 ......................... بس عدنة كم وليد تلكونة زاحف 😂🐢"

ws[34] = "شنو رايك ببنات الكروب"
rs[34] = "بكروبنا ألحلواتْ كلْ وحدَة دُرة 🙈🌺 ..................... وبيّهن تكبل هنا ومكبلةَ برة 😂👊🏻"

ws[35] = "انجب"
rs[35] = "أخ الله لو انت زلمه جان قسمتلك صلي "






ws[39] = "غني"
rs[39] = "🙊شنو شايفني اشتغل مطرب عند الخلفوك 😂"




ws[41] = "تحبني"
rs[41] = " هوايه 😍🙈😍"

ws[42] = "سيف"
rs[42] = "❤️فديتك الضلع بس ضلع واحد الضلع الثاني بعده ما محدد😂"

ws[43] = "😂"
rs[43] = "😂دّوِمِـ اٌلِـضُحٍكُهٌ اٌبّـوِ كُرُشْ😂/اٌمِـ مِـصٍـمِـاٌخً😄️"

ws[44] = "هههه"
rs[44] = "😂دّوِمِـ اٌلِـضُحٍكُهٌ اٌبّـوِ كُرُشْ😂/اٌمِـ مِـصٍـمِـاٌخً😄️"

ws[45] = "ههههه"
rs[45] = "😂دّوِمِـ اٌلِـضُحٍكُهٌ اٌبّـوِ كُرُشْ😂/اٌمِـ مِـصٍـمِـاٌخً😄️"

ws[46] = "😹"
rs[46] = " 😂دّوِمِـ اٌلِـضُحٍكُهٌ اٌبّـوِ كُرُشْ😂/اٌمِـ مِـصٍـمِـاٌخً😄️"

ws[47] = "🌚"
rs[47] = "🌚عّاّبّتّ هّاّلّوّجّةّ اّلّمّسّخّمّ 🌚"

ws[48] = "😍"
rs[48] = " فديتك"

ws[49] = "مح"
rs[49] = " فوديتك❤️"

ws[50] = "الاء"
rs[50] = "😱يا يالله صاكة الكروب وياكم تتحدث من اعلاه المنصه فديتوها لو لا 😂"

ws[51] = "حمودي"
rs[51] = " حمودي حبيبي تراس عيوني بضواك فديتك"

ws[52] = "😭"
rs[52] = " 😢😢 لتبجي"

ws[53] = "😢"
rs[53] = " لتبجي 😭😭"

ws[54] = "شكد عمرك"
rs[54] = "معليك 😂😂"

ws[55] = "شكد عمرج"
rs[55] = " لتسئل البنيه لا عن عمرها ولا وزنها😂"

ws[56] = "اقرالي دعاء"
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂"

ws[57] = "حسام"
rs[57] = "😍يٌّمُّهّْ حّْسًّيٌّمُّ يٌّمُّهّْ فّْدٌّيٌّتُّكّْ حّْيٌّاٍّتُّيٌّ وّكّْبّْدٌّ نِّبُّْْضَّاٍّتُّيٌّ💋"

ws[58] = "زهوره"
rs[58] = "🙊عَيَوًّنَيَ زَّهَوًّرَهَ اَلَوًّرَدَهَ 🌹 اَخَلَاَقَهَاَ طَيَبَهَ مَثَلَ طَعَمَ اَلَبَيَتَزَّهَ وًّتَصَرَفَاَتَهَاَ اَطَيَبَ 😂"

ws[59] = "دانيه"
rs[59] = "😍يَمَهَ فَدَوًّهَ لَدَاَنَيَهَ شَكَدَ اَحَبَهَاَ فَدَيَتَ عَيَوًّنَهَاَ 😍"

ws[60] = "زنوبه"
rs[60] = "💋فدوه لربج زنوبه وفدوه يروحلج الشرس وراعيه الرسمي 😂"

ws[61] = "اكرهك"
rs[61] = " علساس اني احبك تهي بهي 😒🍃"

ws[62] = "😂"
rs[62] = " دوم حبي ❤️"

ws[63] = "الاعضميه"
rs[63] = " احسن ناس وربي❤️"

ws[64] = "ملوكه"
rs[64] = "🙈فديت كلبها شكد طيب🙈️"

ws[65] = "💋"
rs[65] = "🙈لا تبوس ونعال الحمزه استحي☺️️"




ws[67] = "😇"
rs[67] = " انته مو ملاك اته جهنم بنفسهه 😂"

ws[68] = "😐"
rs[68] = " شبيك صافن 😒🔥"

ws[69] = "انجب"
rs[69] = "😒مو صوجك صوج الي يحجي وياك😕"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = "ليش مو اني احبك 😔💔"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " داحس بيك"

ws[75] = "اكولك"
rs[75] = " لتكول 😐😂"

ws[76] = "اكلك"
rs[76] = " لتكول 😐😂"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " احسن ناس وربي❤️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"




ws[83] = "باي"
rs[83] = "✋بّاّيّاّتّ دّرّجّ ✋عّزّيّزّيّ سّدّ اّلّبّاّبّ وّرّاّكّ 😔اّلّفّ رّحّمّهّ عّلّىّ مّوّتّاّكّ لّاّ يّدّخّلّ هّوّىّ حّاّرّ😆"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "فرخ"
rs[90] = " عيبب 😱😱"

ws[92] = "كسمك"
rs[92] = " عيب 😱😱😱"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[98] = "كبلت"
rs[98] = " بلخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " اطردك ؟ 😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "احبك"
rs[107] = " اني اكثر 😍🍃"

ws[108] = "😑"
rs[108] = " شبيك 🍃☹"

ws[109] = "😒"
rs[109] = "😐 شبيك كالب وجهك "

ws[110] = "منو تحب"
rs[110] = "خالتك الشكرة"

ws[111] = "باجر العيد"
rs[111] = "كل عام وانت بالف خير حبي 😇❤️"

ws[112] = "فديت"
rs[112] = "ها زاحف كمشتك"

ws[114] = "فديت"
rs[114] = "ها زاحف كمشتك"

ws[115] = "فديتك"
rs[115] = "ها زاحف كمشتك"

ws[116] = "فديتج"
rs[116] = "ها  زاحف كمشتك"

ws[117] = "شوف خاصك"
rs[117] = "شدازله 😱😨"

ws[118] = "تعال خاص"
rs[118] = "شحسوون 😱"

ws[119] = "تعالي خاص"
rs[119] = "شحسوون 😱"

ws[120] = "دخل السبام"
rs[120] = "شحسوون 😱"

ws[121] = "😎"
rs[121] = "يلا عود انت فد ططوه 😐🍃"

ws[122] = "😱"
rs[122] = "خير خوفتني 😨"

ws[123] = "كحبه"
rs[123] = "عيب 😱"

ws[124] = "بيش الساعة"
rs[124] = "ونص وخمس وربع " 

ws[125] = "🚶🏻"
rs[125] = "خير 🌝"

ws[126] = "منو اكثر واحد تحبه"
rs[126] = "خالتك الشكرة"

ws[127] = "ليش"
rs[127] = "مو شغلك"

ws[128] = "طاسه"
rs[128] = "امك حلوة ورقاصه 💃🏻"

ws[129] = "عشرين"
rs[129] = "تاكل جدر خنين 😫"

ws[130] = "ميه"
rs[130] = "😂تشرب مميه"

ws[131] = "اربعة"
rs[131] = "😂لحيه ابوك مربعه"

ws[132] = "باسم الكربلائي"
rs[132] = "https://www.youtube.com/watch?v=3q3F8Gs8r_M"

ws[133] = "نور الزين"
rs[133] = "https://www.youtube.com/watch?v=mNOzjCfuKaU"

ws[134] = "عيوني"
rs[134] = "https://www.youtube.com/watch?v=UU6uviZdveA"

ws[135] = "اوراس ستار"
rs[135] = "https://www.youtube.com/watch?v=sDpRQWs74AE"

ws[136] = "حاتم العراقي"
rs[136] = "https://www.youtube.com/watch?v=fviF8zuntFo"

ws[137] = "غرك"
rs[137] = "ابو العرك 🍾"

ws[138] = "محمد السالم"
rs[138] = "https://www.youtube.com/watch?v=teswQTJIxAI"

ws[139] = "كاظم الساهر"
rs[139] = "https://www.youtube.com/watch?v=hxFuaZL9pRY"

ws[140] = "معزوفه"
rs[140] = "😂ششششيله عبود💃 \n  💃ترطيط💃 ترطيط 💃 ترطيط 💃ترطيط 💃ترطيط 💃ترطيط💃 \n 🙆يله بنات الكروب كلجن 😂ع الستيج خلي نكيت💵💴💶💷"

ws[141] = "حلو"
rs[141] = "🙈شلون ضكته 🙊"

ws[142] = "حاره"
rs[142] = "https://www.youtube.com/watch?v=a0pLMiwztFU️"

ws[143] = "وين الحمزه"
rs[143] = "أجه الحمزه \n طربك🏇🏻            طربك🏇🏻             طربك🏇🏻            طربك🏇🏻            طربك🏇🏻            طربك🏇🏻 \n وينكم بس لا خلصت المعركة خرب بهبل            "

ws[144] = "المعزوفه"
rs[144] = "https://www.youtube.com/watch?v=Sjfgz7D7vws"

ws[145] = "هشام"
rs[145] = "😱أخ الله هشومتي حبيب فوفه😘"

ws[146] = "لتزحف"
rs[146] = "��ك اسف 🙁😔"

ws[148] = "@os_aa23"
rs[148] = "هذا الي صنعني فديت ربه 🙈❤️"

ws[149] = "فوفه"
rs[149] = "😍أخ يمه الحلوه حبيبت هشام💋"

ws[150] = "صاك"
rs[150] = "😂 منو هذا دزيلي صورهه"

ws[151] = "منو اني"
rs[151] = "انته احلى شي بحياتي ❤️��"

ws[152] = "ابن الكلب"
rs[152] = "عيب ابني 🔥☹"

ws[153] = "انجب انته"
rs[153] = "وك وك 😭😔"

ws[154] = "حطردك"
rs[154] = "اعصابك 😨 لتتهور"

ws[155] = "المطور"
rs[155] = "شتريد من المطور 😐🍃"

ws[156] = "منو اكثر واحد تكرهه"
rs[156] = "انته"

ws[157] = "شباب"
rs[157] = "نعم حبي 🌝❤️"

ws[158] = "انته زلمه"
rs[158] = "تعال لزمه 😐😂"

ws[159] = "الاحد"
rs[159] = "هذا اليوم نحس بلنسبه الي"

ws[160] = "تيست"
rs[160] = "اني شغال ومنتظر اوامرك حبي 😍🙈"

ws[161] = "هلاوو"
rs[161] = "هلاوات ❤️🍃"

ws[162] = "اختك"
rs[162] = "شبيهه 😱"

ws[163] = "كواد"
rs[163] = "عيب 😨😨"

ws[164] = "😌"
rs[164] = "المطلوب ؟"

ws[165] = "هلا"
rs[165] = " 🌚🍃هلاوات"

ws[166] = "مرحبا"
rs[166] = "مرحبتين 😍🍃"

ws[167] = "سلام"
rs[167] = "السلام عليكم 🌝🍃"

ws[168] = "السلام"
rs[168] = "السلام عليكم 🌝🍃"

ws[169] = "السلام عليكم"
rs[169] = "عليكم السلام 🌝🍃"

ws[170] = "تسلم"
rs[170] = "الله يسلمك 😍"


-- the main function
function run( msg, matches )
-- just a local variables that i used in my algorithm 
local i = 0; local w = false

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
i = k; w = true;
end
end

-- check if { w } is not false and { i } not equals to 0
if ( (w ~= false) and (i ~= 0) ) then
-- get the receiver :3 
R = get_receiver(msg)
-- send him the proper message from the index that { i } assigned to
--send_large_msg ( R , rs[i] );
--send_reply(msg.id, rs[i])
reply_msg(msg.id, rs[i], ok_cb, false )
end

-- don't edit this section
if ( msg.text == "about" ) then
if ( msg.from.username == "Mouamle" ) then
R = get_receiver(msg)
send_large_msg ( R , "Made by @Mouamle" );
end
end 

end



return {
patterns = {
"(.*)"	
},
run = run
} 


end
